# AreaLoadNoForce Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..AreaLoadNoForce Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area Load can't have all force components equal to zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaLoadNoForce { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaLoadNoForce As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaLoadNoForce {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace